dkuznets/flight_v2/CAN/src/CAN_LPC229x_Custom.c
/*------------------------ CAN_hw_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN    *ptrcan    = (regCAN *) CAN_BASE[ctrl0];
  U32 result = 0;
  U32 nominal_time;

  /* Determine which nominal time to use for PCLK and baudrate               */
  if (baudrate <= 500000)  {
    nominal_time = 12;
  }  else if (((PCLK / 1000000) % 15) == 0)  {
    nominal_time = 15;
  }  else if (((PCLK / 1000000) % 16) == 0)  {
    nominal_time = 16;
  }  else  {
    nominal_time = 10;
  }

  /* Prepare value appropriate for bit time register                         */
  result  = (PCLK / nominal_time) / baudrate - 1;
  result &= 0x000003FF;
  result |= CAN_BIT_TIME[nominal_time];

  ptrcan->CANBTR  = result;                      /* Set bit timing           */

  return CAN_OK;
}

/*************************** Module Functions ********************************/

/*--------------------------- CAN_hw_setup ----------------------------------
 *
 *  Setup CAN transmit and receive PINs and interrupt vectors
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_setup (U32 ctrl)  {
  switch (ctrl) {
    case 1: 
      #if USE_CAN_CTRL1 == 1
        PINSEL1 &= 0xFFF3FFFF;        /* Reset CAN1 bits                     */
        PINSEL1 |= 0x00040000;        /* Set CAN1 bits to bin 01             */
    
        /* Set interrupt vector for Tx1                                      */
        *(&VICVectAddr0 + VIC_NUM_CTRL1_TX) = (unsigned long) CAN_TX1_ISR;
        *(&VICVectCntl0 + VIC_NUM_CTRL1_TX) = 0x20 | 20;
        /* Set interrupt vector for Rx1                                      */
        *(&VICVectAddr0 + VIC_NUM_CTRL1_RX) = (unsigned long) CAN_RX1_ISR;       
        *(&VICVectCntl0 + VIC_NUM_CTRL1_RX) = 0x20 | 26;
    
        VICIntEnable = 0x04100000;    /* Enable CAN Tx1 and Rx1 Interrupt    */
      #endif
      break;
    case 2: 
      #if USE_CAN_CTRL2 == 1
        PINSEL1 &= 0xFFFC3FFF;        /* Reset CAN2 bits                     */
        PINSEL1 |= 0x00014000;        /* Set CAN2 bits to bin 0101           */
    
        /* Set interrupt vector for Tx2                                      */
        *(&VICVectAddr0 + VIC_NUM_CTRL2_TX) = (unsigned long) CAN_TX2_ISR;
        *(&VICVectCntl0 + VIC_NUM_CTRL2_TX) = 0x20 | 21;
        /* Set interrupt vector for Rx2                                      */
        *(&VICVectAddr0 + VIC_NUM_CTRL2_RX) = (unsigned long) CAN_RX2_ISR;
        *(&VICVectCntl0 + VIC_NUM_CTRL2_RX) = 0x20 | 27;
    
        VICIntEnable = 0x08200000;    /* Enable CAN Tx2 and Rx2 Interrupt    */
      #endif
      break;
    case 3: 
      #if USE_CAN_CTRL3 == 1
        PINSEL1 &= 0xFFFFC3FF;        /* Reset CAN3 bits                     */
        PINSEL1 |= 0x00001800;        /* Set CAN3 bits to bin 0110           */
    
        /* Set interrupt vector for Tx3                                      */
        *(&VICVectAddr0 + VIC_NUM_CTRL3_TX) = (unsigned long) CAN_TX3_ISR;
        *(&VICVectCntl0 + VIC_NUM_CTRL3_TX) = 0x20 | 22;
        /* Set interrupt vector for Rx3                                      */
        *(&VICVectAddr0 + VIC_NUM_CTRL3_RX) = (unsigned long) CAN_RX3_ISR;
        *(&VICVectCntl0 + VIC_NUM_CTRL3_RX) = 0x20 | 28;
    
        VICIntEnable = 0x10400000;    /* Enable CAN Tx3 and Rx3 Interrupt    */
      #endif
      break;
    case 4: 
      #if USE_CAN_CTRL4 == 1
        PINSEL0 &= 0xF0FFFFFF;        /* Reset CAN4 bits                     */
        PINSEL0 |= 0x0F000000;        /* Set CAN4 bits to bin 1111           */
    
        /* Set interrupt vector for Tx4                                      */
        *(&VICVectAddr0 + VIC_NUM_CTRL4_TX) = (unsigned long) CAN_TX4_ISR;
        *(&VICVectCntl0 + VIC_NUM_CTRL4_TX) = 0x20 | 23;
        /* Set interrupt vector for Rx4                                      */
        *(&VICVectAddr0 + VIC_NUM_CTRL4_RX) = (unsigned long) CAN_RX4_ISR;
        *(&VICVectCntl0 + VIC_NUM_CTRL4_RX) = 0x20 | 29;
    
        VICIntEnable = 0x20800000;    /* Enable CAN Tx4 and Rx4 Interrupt    */
      #endif
      break;
    default:
      return CAN_UNEXIST_CTRL_ERROR;
  }

  return CAN_OK;
}

/*--------------------------- CAN_hw_init -----------------------------------
 *
 *  Initialize the CAN hardware
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_init (U32 ctrl, U32 baudrate)  {
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN_AF *ptrcan_af = (regCAN_AF *) CAN_AF_BASE;
  regCAN    *ptrcan    = (regCAN *) CAN_BASE[ctrl0];

  ptrcan_af->AFMR = 1;                /* Disable acceptance filter           */
  ptrcan->CANMOD  = 1;                /* Enter reset mode                    */
  ptrcan->CANIER  = 0;                /* Disable all interrupts              */
  ptrcan->CANGSR  = 0;                /* Clear status register               */
  CAN_hw_set_baudrate(ctrl, baudrate);/* Set bit timing                      */
  ptrcan->CANIER  = 0x0603;           /* Enable Tx and Rx interrupt          */

  CAN_std_cnt = 0;                    /* Reset standard & extended ID counters*/
  CAN_ext_cnt = 0;                    /* to store array with new IDs         */
      
  return CAN_OK;
}

/*--------------------------- CAN_hw_start ----------------------------------
 *
 *  Enable the CAN interrupts (recive or/and transmit)
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

