dkuznets/flight_v2/CAN/src/CAN_LPC229x_Custom.c
CAN_ERROR CAN_hw_start (U32 ctrl)  {
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN *ptrcan = (regCAN *) CAN_BASE[ctrl0];

  ptrcan->CANMOD = 0;                 /* Enter normal operating mode         */

  return CAN_OK;
}

/*--------------------------- CAN_hw_tx_empty -------------------------------
 *
 *  Check if controller is available for transmission
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_empty (U32 ctrl)  {
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN *ptrcan = (regCAN *) CAN_BASE[ctrl0];

  if ((os_sem_wait (wr_sem[ctrl-1], 0) != OS_R_TMO)){ /* If semaphore is free*/
    if (ptrcan->CANSR & 0x00000004)               /* Transmitter ready for   */
                                                  /* transmission            */
      return CAN_OK;
    else 
      os_sem_send(wr_sem[ctrl-1]);    /* Return a token back to semaphore    */
  }

  return CAN_TX_BUSY_ERROR;
}

/*----------------------- CAN_hw_tx_empty_keep_state -------------------------
 *
 *  Check if controller is available for transmission, but not decrementing
 *  the write semaphore token (by A.Kozyrev)
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_empty_keep_state (U32 ctrl)  {
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN *ptrcan = (regCAN *) CAN_BASE[ctrl0];

  if ((os_sem_wait (wr_sem[ctrl0], 0) != OS_R_TMO)){ /* If semaphore is free*/

    os_sem_send(wr_sem[ctrl0]);                   /* Return a token back to semaphore    */

    if (ptrcan->CANSR & 0x00000004)               /* Transmitter ready for   */
      return CAN_OK;                              /* transmission            */
  }

  return CAN_TX_BUSY_ERROR;
}

/*--------------------------- CAN_hw_tx_abort -------------------------------
 *
 *  Abort transmittion (by A.Kozyrev)
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_abort(U32 ctrl)
{
	U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
 	regCAN *ptrcan = (regCAN *) CAN_BASE[ctrl0];

	if((os_sem_wait(wr_sem[ctrl0], 0) != OS_R_TMO)) /* If semaphore is free */
	{
		// nothing to abort, just exit
	    os_sem_send(wr_sem[ctrl0]);                 /* Return a token back to semaphore    */
		return CAN_OK;
	}

    if(!(ptrcan->CANSR & 0x00000004))               /* If transmitter is busy       */
	{
		ptrcan->CANCMR |= 0x00000002;               /* Abort Transmittion        */

		while(!(ptrcan->CANSR & 0x00000004));	    /* Wait untill transmitter becomes free */

		if(os_sem_wait(wr_sem[ctrl0], 0xffff) != OS_R_TMO) /* Wait for the token to be returned (by CAN_TXn_ISR) */
		    os_sem_send(wr_sem[ctrl0]);             /* Return a token back to semaphore    */
	}

   	return CAN_OK;
}

/*--------------------------- CAN_hw_rx_get_err_counter ----------------------
 *
 *  Read current RXERR counter register (by A.Kozyrev)
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     U8:         Number of RX errors
 *---------------------------------------------------------------------------*/

U8 CAN_hw_rx_get_err_counter(U32 ctrl)
{
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN *ptrcan = (regCAN *)CAN_BASE[ctrl0];

  return ((ptrcan->CANGSR & 0x00ff0000) >> 16);
}

/*--------------------------- CAN_hw_tx_get_err_counter ----------------------
 *
 *  Read current TXERR counter register (by A.Kozyrev)
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     U8:         Number of TX errors
 *---------------------------------------------------------------------------*/

U8 CAN_hw_tx_get_err_counter(U32 ctrl)
{
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN *ptrcan = (regCAN *)CAN_BASE[ctrl0];

  return ((ptrcan->CANGSR & 0xff000000) >> 24);
}

/*------------------------ CAN_hw_tx_reset_err_counter ------------------------
 *
 *  Reset TX error counter register (by A.Kozyrev)
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     -
 *
 *---------------------------------------------------------------------------*/

void CAN_hw_tx_reset_err_counter(U32 ctrl)
{
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN *ptrcan = (regCAN *)CAN_BASE[ctrl0];
  U32 interrupts;

  interrupts = VICIntEnable;
  VICIntEnClr = interrupts;

  ptrcan->CANMOD |=  (1<<0);          /* enter Reset mode                    */
  ptrcan->CANGSR &= ~(0xff000000);    /* reset TX error counter bits		 */
  ptrcan->CANMOD &= ~(1<<0);          /* enter Normal operating mode         */

  VICIntEnable = interrupts;
}

/*------------------------ CAN_hw_rx_reset_err_counter------------------------
 *
 *  Reset RX error counter register (by A.Kozyrev)
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     -
 *
 *---------------------------------------------------------------------------*/

void CAN_hw_rx_reset_err_counter(U32 ctrl)
{
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN *ptrcan = (regCAN *)CAN_BASE[ctrl0];
  U32 interrupts;

  interrupts = VICIntEnable;
  VICIntEnClr = interrupts;

  ptrcan->CANMOD |=  (1<<0);          /* enter Reset mode                    */
  ptrcan->CANGSR &= ~(0x00ff0000);    /* reset RX error counter bits         */
  ptrcan->CANMOD &= ~(1<<0);          /* enter Normal operating mode         */

  VICIntEnable = interrupts;
}

/*------------------------ CAN_hw_clear_reset_mode ---------------------------
 *
 *  Clears RM (reset mode) bit in CANMOD register (by A.Kozyrev)
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     -
 *
 *---------------------------------------------------------------------------*/

void CAN_hw_clear_reset_mode(U32 ctrl)
{
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  regCAN *ptrcan = (regCAN *)CAN_BASE[ctrl0];

  ptrcan->CANMOD &= ~(1<<0);          /* enter Normal operating mode         */
}

/*--------------------------- CAN_hw_wr -------------------------------------
 *
 *  Write CAN_msg to the hardware registers of the requested controller
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              msg:        Pointer to CAN message to be written to hardware
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_wr (U32 ctrl, CAN_msg *msg)  {
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  U32 CANData;
  regCAN *ptrcan = (regCAN *) CAN_BASE[ctrl0];

  CANData       = (((U32) msg->len) << 16)          & 0x000F0000 | 
                  (msg->format == EXTENDED_FORMAT ) * 0x80000000 |
                  (msg->type   == REMOTE_FRAME)     * 0x40000000;

  if (ptrcan->CANSR & 0x00000004)  {  /* Transmit buffer 1 free              */
    ptrcan->CANTF1  = CANData;        /* Write frame informations            */
    ptrcan->CANTID1 = msg->id;        /* Write CAN message identifier        */
    ptrcan->CANTDA1 = *(U32 *) &msg->data[0]; /* Write first 4 data bytes    */
    ptrcan->CANTDB1 = *(U32 *) &msg->data[4]; /* Write second 4 data bytes   */
    ptrcan->CANCMR  = 0x30;           /* Start self-transmission             */
    //ptrcan->CANCMR  = 0x20;         /* Start transmission without loop-back*/
  }
  else
    return CAN_TX_BUSY_ERROR;

  return CAN_OK;
}


/*--------------------------- CAN_hw_rd -------------------------------------
 *
 *  Read CAN_msg from the hardware registers of the requested controller
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              msg:        Pointer where CAN message will be read
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static void CAN_hw_rd (U32 ctrl, CAN_msg *msg)  {
  U32 ctrl0 = ctrl-1;                 /* Controller index 0 .. x-1           */
  U32 CANData;
  U32 *CANAddr;
  regCAN *ptrcan = (regCAN *) CAN_BASE[ctrl0];

  /* Read frame informations                                                 */
  CANData = ptrcan->CANRFS;
  msg->format   = (CANData & 0x80000000) == 0x80000000;
  msg->type     = (CANData & 0x40000000) == 0x40000000;
  msg->len      = ((U8)(CANData >> 16)) & 0x0F;

