dkuznets/flight_v2/CAN/src/CAN_LPC229x_Custom.c
    bound1 = CAN_ext_cnt - 1;
    /* Move all remaining extended mask entries one place up                 */
    while (cnt2 < bound1)  {
      cnt1++;
      cnt2++;
      buf1 = ptrcan_afram->mask[cnt1];
      ptrcan_afram->mask[cnt1] = buf0;
      buf0 = buf1;
    }        
  }
  
  /* Calculate std ID start address (buf0) and ext ID start address (buf1)   */
  buf0 = ((CAN_std_cnt + 1) >> 1) << 2;
  buf1 = buf0 + (CAN_ext_cnt << 2);

  /* Setup acceptance filter pointers                                        */
  ptrcan_af->SFF_sa     = 0;
  ptrcan_af->SFF_GRP_sa = buf0;
  ptrcan_af->EFF_sa     = buf0;
  ptrcan_af->EFF_GRP_sa = buf1;
  ptrcan_af->ENDofTable = buf1;

  ptrcan_af->AFMR = 0x00000000;       /* Use acceptance filter               */

  return CAN_OK;
}

/*--------------------------- CAN_hw_tx_object ------------------------------
 *
 *  This function has no usage on LPC2xxx, and so it does nothing
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              ch:         Ignored for LPC2xxx
 *              id:         CAN message identifier
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_object (U32 ctrl, U32 ch, U32 object_para)  {

  return CAN_OK;
}


/************************* Interrupt Functions *******************************/

#if USE_CAN_CTRL1 == 1

/*--------------------------- CAN_TX1_ISR ----------------------------------
 *
 *  CAN transmit interrupt function for controller 1
 *  If there are messages in mailbox for transmit it writes it to hardware
 *  and starts the transmission on controller 1
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void CAN_TX1_ISR (void) __irq  {
  CAN_msg *ptrmsg;
  U32 temp;

    /* If there is message in mailbox ready for send, 
       read the message from mailbox and send it                             */
    if (isr_mbx_receive (MBX_tx_ctrl[0], (void **)&ptrmsg) != OS_R_OK) {
      CAN_hw_wr (1, ptrmsg);
      _free_box(CAN_mpool, ptrmsg);
  } else {
    isr_sem_send(wr_sem[0]);      /* Return a token back to semaphore        */
  }

  /* Read from interrupt register to acknowledge interrupt                   */
  temp = ptrCAN1->CANICR;
  VICVectAddr = 0xFFFFFFFF;           /* Acknowledge Interrupt               */
}


/*--------------------------- CAN_RX1_ISR -----------------------------------
 *
 *  CAN receive interrupt function, for CAN controller 1
 *  Reads message from hardware registers and puts it into receive mailbox
 *  for controller 1
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void CAN_RX1_ISR (void) __irq  {
  CAN_msg *ptrmsg;

  /* If mailbox isn't full read message from hardware and send it to message queue */
  if (os_mbx_check (MBX_rx_ctrl[0]) > 0) {
    ptrmsg = _alloc_box (CAN_mpool);
    CAN_hw_rd (1, ptrmsg);
    if (ptrmsg) isr_mbx_send (MBX_rx_ctrl[0], ptrmsg);
  }

  ptrCAN1->CANCMR = 0x04;             /* Release receive buffer              */
  VICVectAddr = 0xFFFFFFFF;           /* Acknowledge interrupt               */
}

#endif


#if USE_CAN_CTRL2 == 1

/*--------------------------- CAN_TX2_ISR ----------------------------------
 *
 *  CAN transmit interrupt function for controller 2
 *  If there are messages in mailbox for transmit it writes it to hardware
 *  and starts the transmission on controller 2
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void CAN_TX2_ISR (void) __irq  {
  CAN_msg *ptrmsg;
  U32 temp;

    /* If there is message in mailbox ready for send, 
       read the message from mailbox and send it                             */
    if (isr_mbx_receive (MBX_tx_ctrl[1], (void **)&ptrmsg) != OS_R_OK) {
      CAN_hw_wr (2, ptrmsg);
      _free_box(CAN_mpool, ptrmsg);
  } else {
    isr_sem_send(wr_sem[1]);      /* Return a token back to semaphore        */
  }

  /* Read from interrupt register to acknowledge interrupt                   */
  temp = ptrCAN2->CANICR;
  VICVectAddr = 0xFFFFFFFF;           /* Acknowledge Interrupt               */
}


/*--------------------------- CAN_RX2_ISR -----------------------------------
 *
 *  CAN receive interrupt function, for CAN controller 2
 *  Reads message from hardware registers and puts it into receive mailbox
 *  for controller 2
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void CAN_RX2_ISR (void) __irq  {
  CAN_msg *ptrmsg;

  /* If mailbox isn't full read message from hardware and send it to message queue */
  if (os_mbx_check (MBX_rx_ctrl[1]) > 0) {
    ptrmsg = _alloc_box (CAN_mpool);
    CAN_hw_rd (2, ptrmsg);
    if (ptrmsg) isr_mbx_send (MBX_rx_ctrl[1], ptrmsg);
  }

  ptrCAN2->CANCMR = 0x04;             /* Release receive buffer              */
  VICVectAddr = 0xFFFFFFFF;           /* Acknowledge interrupt               */
}

#endif


#if USE_CAN_CTRL3 == 1

/*--------------------------- CAN_TX3_ISR ----------------------------------
 *
 *  CAN transmit interrupt function for controller 3
 *  If there are messages in mailbox for transmit it writes it to hardware
 *  and starts the transmission on controller 3
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void CAN_TX3_ISR (void) __irq  {
  CAN_msg *ptrmsg;
  U32 temp;

    /* If there is message in mailbox ready for send, 
       read the message from mailbox and send it                             */
    if (isr_mbx_receive (MBX_tx_ctrl[2], (void **)&ptrmsg) != OS_R_OK) {
      CAN_hw_wr (3, ptrmsg);
      _free_box(CAN_mpool, ptrmsg);
  } else {
    isr_sem_send(wr_sem[2]);      /* Return a token back to semaphore        */
  }

  /* Read from interrupt register to acknowledge interrupt                   */
  temp = ptrCAN3->CANICR;
  VICVectAddr = 0xFFFFFFFF;           /* Acknowledge Interrupt               */
}


